# Дано число. Проверить кратно ли оно 5 и 10 или 15 но НЕ 30
a = float(input("Введите число: "))
print((a % 5 == 0 and a % 10 == 0 or a % 15 == 0) and a % 30 != 0)
