# Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.
# *** Последовательность понял так: (1+1/1)**1, (1+1/2)**2, ... , (1+1/n)**n
# Пример:
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
def sequence(n):
    list = []
    for i in range(1, n + 1):
        list.append(round((1 + 1 / i) ** i, 2))
    return list


n = 6
print(f"{n = }: {sequence(n)}")
